In [2]:
import pandas as pd
import numpy as np

# Processing dim_hotels table

In [13]:
hotels = pd.read_csv(r'dataset/dim_hotels.csv')
hotels.head()

   property_id  property_name  category    city
0        16558   atliq Grands    Luxury   Delhi
1        16559  Atliq Exotica    Luxury  Mumbai
2        16560     Atliq City  Business   Delhi
3        16561      Atliq Blu    Luxury   Delhi
4        16562      Atliq Bay    Luxury   Delhi

In [19]:
hotels.dtypes

property_id       int64
property_name    object
category         object
city             object
dtype: object

In [20]:
hotels['property_id'] = hotels['property_id'].astype('str')

In [21]:
# hotels.dtypes

property_id      object
property_name    object
category         object
city             object
dtype: object

In [14]:
hotels['property_name'] = hotels['property_name'].replace("Â¢","")
hotels['property_name'] = hotels['property_name'].str.strip().str.capitalize()

In [16]:
hotels.head()

   property_id  property_name  category    city
0        16558   Atliq grands    Luxury   Delhi
1        16559  Atliq exotica    Luxury  Mumbai
2        16560     Atliq city  Business   Delhi
3        16561      Atliq blu    Luxury   Delhi
4        16562      Atliq bay    Luxury   Delhi

In [25]:
# max_keyId = hotels['property_id'].sort_values().max()